# Задаём константу точности
EPSILON = 0.0000001
# Функция проверки: угадали ли мы число с учётом точности
def is_correct(guess, secret):
    # Проверяем, насколько наше предположение близко к загаданному числу.
    # Если разница меньше нашей точности — значит, мы угадали.
    if abs(guess - secret) < EPSILON:
        return True
    return False
# Основная функция бинарного поиска
def guess_number(secret):
    # Устанавливаем нижнюю границу диапазона (минимум -10^9)
    low = -10 ** 9
    # Устанавливаем верхнюю границу диапазона (максимум 10^9)
    high = 10 ** 9
    # Цикл работает до тех пор, пока разница между границами больше точности
    while high - low > EPSILON:
        # Находим середину текущего диапазона (целочисленное деление)
        mid = (low + high) / 2

        # Проверяем, является ли середина загаданным числом
        if is_correct(mid, secret):
            # Если да — возвращаем число и количество попыток
            return mid
        # Если наше число меньше загаданного
        elif mid < secret:
            # Сдвигаем нижнюю границу вправо (ищем в большей половине). Без +1, такт как тип float
            low = mid
        # Если наше число больше загаданного
        else:
            # Сдвигаем верхнюю границу влево (ищем в меньшей половине). Без -1, такт как тип float
            high = mid

    # Если число не найдено (такое невозможно при верном диапазоне), возвращаем None
    return None


# Точка входа в программу
if __name__ == "__main__":
    # Загадываем число для теста
    secret_number = float(input())

    # Вызываем функцию угадывания и получаем результат
    result = guess_number(secret_number)

    # Выводим на экран загаданное число и количество затраченных попыток
    print(f"Загаданное число: {result}")
